[
  {
    "url": "https://giftofhealth.org/",
    "content": "Learn the shocking truth about sugar’s impact on your liver, brain, and energy — and discover how to enjoy desserts that heal instead of harm. Imagine this: You start your day with “healthy” cereal and almond milk. Lunch is a protein bar and a flavoured yogurt. Dinner? A “low-fat” frozen meal. You didn’t touch dessert […] View more  Most doctors long to heal, yet feel limited by the system. What if there’s more? A stirring call to rethink medicine—for those who care and those who suffer. View more  Your grocery cart may predict your future health. Discover one powerful shift to reclaim vitality, from a surgeon’s lens on food and disease. View more    Raise awareness about the connection between food/lifestyle choices and health. Help you reach your highest health. Create and foster healthy environment for our children. Decrease unnecessary suffering on our planet. Upcoming Workshops 26sep(sep 26)3:00 pm06nov(nov 6)5:00 pmFeatured6weeks Online GOH Food as Medicine ProgramOnline Course(september 26) 3:00 pm - (november 6) 5:00 pm NT Event Type :Online Course Click here for more DetailsStart Date:  26th Sep 2025\nEnd Date:  6th Nov 2025 \nRegister Here:   September 26 (Friday) 3:00 pm - November 6 (Thursday) 5:00 pm   LINKhttps://giftofhealth.org/6wks_online_course/course-detail.html   Gift of Health giftofhealth1@gmail.com CalendarGoogleCal  By giftofhealth By giftofhealth By giftofhealth By giftofhealth By giftofhealth By giftofhealth By giftofhealth By giftofhealth  2017 Gift of Health, all rights reserved."
  },
  {
    "url": "https://giftofhealth.org/6wks_online_course",
    "content": "The secret is the Gift of Health.  Weâ\u0080\u0099re excited to share it with you  â\u0080¦but if youâ\u0080\u0099re ready to get started,  click here  For years, I struggled with my weight and health issues and tried many diets before. Gift of Health experience has changed my life. I am off of my diabetic pills. My HbA1c went from 8.9 to 6.4. I no longer need medications for high blood pressure and high cholesterol. My acid reflux is gone. I am down 60 pounds, have more energy and enjoying my time with family with full health.  My high school friend said, â\u0080\u009cI can't get over how good you look.â\u0080\u009d I lost over 70 pounds and finally met the weight goal that I have been struggling to reach for 15 years. I am free from asthma, chronic back pain, and even ran a 10-mile race. This time last year, I would have never believed that I would be able to run!! Forget about running, I wouldnâ\u0080\u0099t have been able to walk that far!!  High blood pressure, arthritis, high cholesterol, acid reflux, obesity, heart disease -- BILLIONS of people worldwide suffer from these health conditions on a daily basis. These are the culprits forcing amazing people to stop their careers, shortcut their dreams, and in many cases, lose their lives. As if the physical toll isnâ\u0080\u0099t great enough, the financial effect is staggering. Many of us canâ\u0080\u0099t afford to miss work because of their financial responsibilities at home. Mountains of doctor bills, insurance claims, specialist visits, and a cabinet full of new medications are expensive to cover -- and the stress alone can be fatal. The heartbreaking reality is that the people fighting their health conditions aren't the only ones affected. Friends and family are the ones left suffering as their loved one fights for their future. Every moment spent fighting a disease or diagnosis is a moment theyâ\u0080\u0099re not free to celebrate birthdays, make memories, or even enjoy a favorite meal together without the cloud of illness overhead. It doesnâ\u0080\u0099t have to be this way... Even if you arenâ\u0080\u0099t facing a chronic disease diagnosis, thereâ\u0080\u0099s still tremendous frustration when it comes to losing weight. â\u0080\u009cI canâ\u0080\u0099t seem to just get rid of this weight for good! This isnâ\u0080\u0099t working for me!â\u0080\u009d Maybe youâ\u0080\u0099ve tried every form of diet under the sun, grueling exercise programs that donâ\u0080\u0099t seem to produce great results, and before you know it, youâ\u0080\u0099re back eating that last slice of cheesecake at 2 a.m. - not that ANY of us have ever done thatâ\u0080¦  Whether youâ\u0080\u0099re ready to admit it or not - this is a dangerous path, but you know that. You donâ\u0080\u0099t need anyone telling you again how bad it is to carry extra weight, how much added risk you experience for your long-term health with being overweightâ\u0080¦ Youâ\u0080\u0099ve probably heard doctor after doctor encouraging you, no, begging you to lose the weight. So, you try the diets, ALL the diets, and you experience the same results: nothing. Maybe you did lose some weight, but in almost no time whatsoever, the weight came back plus some more. Again, it doesnâ\u0080\u0099t have to be that wayâ\u0080¦ Can we share a secret? The key to getting healthier often has very little to do with doctors, medications, treatments, or even stepping foot inside a clinic. It starts at the grocery store, in your kitchen, and on your plate.  What if all you need to regain your health is to change the way you eat? Thatâ\u0080\u0099s it -- no new medication, no crazy fad diet, no bizarre mixture of tinctures, oils, lotions, and God knows what elseâ\u0080¦ You can begin to prevent and even reverse chronic conditions by implementing a plant-based diet for six weeks or less. Yes, you CAN lose weight, feel better, reduce your dependence on medications, and be happy, healthy, and free. This isnâ\u0080\u0099t rocket science - this is Nutrition 101 with delicious, nourishing foods that love your body better so you can live your healthiest life possible. My dad inspired me to become a doctor. For most of his life, my dad struggled with diabetes, high blood pressure, and high cholesterol. In March 2015, my dad started having shortness of breath and his tests showed that he had more than 90% blockages in two out of three main blood vessels that supply his heart. One cardiologist suggested putting in stents and another cardiologist recommended bypass surgery. When my dad shared the news of his blocked heart blood vessels and his impending open heart surgery, I felt my own heart break. Yes, his heart was in BIG trouble.  On top of that, the choices his â\u0080\u0098expertsâ\u0080\u0099 offered him were risky procedures. I said, â\u0080\u009cDad - instead of having your chest cut open, why don't you open your mouth and eat different plant-based foods that will help your heart from the inside out?â\u0080\u009d It was a big risk for me to suggest this approach because I already felt responsibility as a doctor, but it compounded even more knowing this was my dad. He wasnâ\u0080\u0099t too excited about that, but he decided to give it a try. He embraced a plant-based lifestyle and was totally amazed!  Just two weeks later, he was walking longer distances with no shortness of breath and his blood sugar control was so good that his doctor cut his diabetic pills by 50%. Within three months, my dad reversed his diabetes, high blood pressure, and high cholesterol and came off of FIVE different medications. He even lost 25 pounds without doing any exercise and looked younger. In only six months, he successfully completed the heart treadmill stress test that he was previously unable to do, and most of all he avoided the risky, invasive procedures on his heartâ\u0080¦ that he didnâ\u0080\u0099t need after all because he started eating better foods.  Hi, we are Drs. Arjun and Shobha Rayapudi, Board-Certified Lifestyle Medicine Physicians and the creators of the life-changing â\u0080\u009cGift of Healthâ\u0080\u009d workshops. Our work was featured in the documentary â\u0080\u009cPlantify,â\u0080\u009d broadcast on the national Canadian Broadcasting Corp (CBC) TV.  We have helped thousands of people prevent and reverse chronic diseases, end the frustrating dieting cycle, lose weight, get off medications for good, and find freedom from the ever-rising costs of drugs and medical bills. The secret? The quality of food you give to your body. While sometimes medication and surgery are necessary, we have found that food is more powerful than surgery. The most impressive miracles weâ\u0080\u0099ve seen are because of simple dietary changes. When you pay attention to how food affects your health and sense of well-being, that simple shift in focus can bring about remarkable results. Nurturing your body with foods that love you back can solve many ailments, diseases, and chronic conditions. Food is consistently more powerful than medicine when it comes to reversing chronic illnesses, such as diabetes, high blood pressure, auto-immune conditions, and gut diseases, such as acid reflux and irritable bowels. In fact, when it comes to heart disease and the consequences of diabetes, such as diabetic ulcers, there are many instances where food is even better than surgery. Weâ\u0080\u0099ve seen it work time and time again. It starts with the Gift of Health. I used up all my sick leave, and I had to go on long-term disability for a while. Now, I can move around without much pain in my knee, and I am back to work full-time. \n\t\t\t\t\t\tI suffered from irritable bowels and diarrhea daily as long as I can remember. Since I started following the Gift of Health way of eating my bowels are not an issue anymore. This Is Your Invitation to Prevent, Arrest, and Even Reverse Health Conditions Through Food The Gift of Health is a six-week online experience helping you take charge of your health, break free from disease and drugs, and change your destiny through better food. Traditional medicine takes a symptom-obsessed, band-aid approach to chronic diseases with drugs and procedures that donâ\u0080\u0099t address the root cause. The Gift of Health is a revolutionary new approach to health that strikes the root cause of the disease: diet and lifestyle choices.  More than 90% of the patients we see in clinics and hospitals are due to diseases caused by poor diet and lifestyle choices. We have seen time and time again that a plant-based lifestyle, backed by thousands of studies, has been safer and more effective than medications and surgery to prevent and reverse chronic disease. Some of you may be saying, â\u0080\u009cNo way, I could never do that!â\u0080\u009d -- Just hold on! You sound like most of the people that come to our workshops. They are concerned that they have to give up their favorite foods and eat like a rabbit and yet nothing could be further from the truth. We invite you to give it a try for yourself for 6 weeks. And if you don't notice amazing results and feel a whole lot better, you can always return to the way you have been eating. I have lost 30 lbs and was able to stop taking medications for diabetes since adopting a plant based lifestyle after attending the gift of health workshop in March 2016. The inflammation in my joints has disappeared as well. Attending the Gift of Health Workshop has changed my life. There are six key modules of The Gift of Healthâ\u0080¦  Module 01 Understanding your body is foundational for reversing and preventing chronic conditions in your body. Our bodies are perfectly designed to heal as long as we provide the right conditions. Module 1 is where we study how the body functions, the root causes of chronic diseases, and foodâ\u0080\u0099s role in causing or preventing chronic diseases from affecting your body. Module 02 There are countless food and dieting myths online today -- how do you know what actually works? Module 2 is where we examine which foods cause you to become fat, sick, and tired -- and which foods will love you back by giving you amazing health. Youâ\u0080\u0099ll learn the principle of calorie density so you can eat more, weigh less, and feel fantastic.  Module 03 Module 3 will show you how to â\u0080\u0098plantifyâ\u0080\u0099 your life, creating a specific plant-based way of eating to support your specific health conditions. Commit to your plan for six weeks to see optimal results and you may be amazed! Module 04 â\u0080\u009cHow do I find the right foods in the grocery store?â\u0080\u009d  â\u0080\u009cHow do I prepare great plant-based meals when Iâ\u0080\u0099m super busy?â\u0080\u009d  â\u0080\u009cHow do I handle all of my troublesome cravings?â\u0080\u009d These are all massive questions you WILL face once you make the decision to plantify your life. We all have a finite amount of willpower, so how do you build the skillpower to help you stay on track and love the way you feel without falling off the wagon? Thatâ\u0080\u0099s where Module 4 is your new best friend. We will show you how to read food labels, pick the right foods, easily prepare meals in a short amount of time, and fight off those troublesome cravings with your Cravings Escape Plan. Module 05 â\u0080\u009cHow do I plantify my life when Iâ\u0080\u0099m travelling?â\u0080\u009d  â\u0080\u009cWhat do I order at restaurants now?â\u0080\u009d  Plantifying your life doesnâ\u0080\u0099t have to stay home when youâ\u0080\u0099re away. You can create conditions for maintaining your new way of eating every single day. Wellness anytime anywhere means you know what to order at restaurants (that actually tastes good!) and how to eat well on the road, even with colleagues or extended family.  Weâ\u0080\u0099ve all been plagued by those who mean well but really are uninformed when it comes to our own health. Learn how to deal with people who donâ\u0080\u0099t understand your new way of eating, including your mother-in-law. When someone rolls their eyes or gives you a hard time, youâ\u0080\u0099ll know how to respond with confidence and ease. Stay on your plan and continue restoring your health anytime, anywhere. Module 06 â\u0080\u009cIâ\u0080\u0099m the only person I know whoâ\u0080\u0099s doing this!â\u0080\u009d Sound familiar? It wonâ\u0080\u0099t be that way with The Gift of Health. We connect you with other like-minded health-conscious individuals as your own support community to help you keep on the path of health and steer away from temptation. Youâ\u0080\u0099ll get access to new recipes, ideas, and tips to make plantifying your life easier than you may expect. Get the support and encouragement you need when you need it to sustain your plantified life well into the future.   In the Gift of Health course, each week you will have access to new module training and have 2 live group calls where we will reinforce how to make that training a part of your life take your questions. During the course you will receive invaluable support from an incredible community of like-minded people so you can stay on the path of health and donâ\u0080\u0099t fall off the wagon. This course is based on our world-renowned Gift of Health workshop that people have traveled from all over the world to attend. Now for the first time we are making it available for the global audience, so that you can have the same benefits without spending thousands on travel. Satisfaction Guarantee: The most important thing for us is helping you reach your health goals. There will be challenges. If you follow the Gift of Health program and do the work, you will overcome challenges and improve your health. If you go through the program and do the homework for 30 days and are still not satisfied with the program, write to us, share your homework, and we will give your money back. No â\u0080\u0098naggingâ\u0080\u0099 questions, no hard feelings - we simply want to see you succeed. I feel fantastic! I have lost weight and have so much more energy! Gone are the sleepless nights and those pesky hot flashes!!! I sleep like a baby now and rarely suffer from hot flashes! My blood sugar readings are better than they have been in years! Before Gift of Health, I was a sad person, dragging myself through my days! Now, I have the same vitality I had when I was much younger! Mentally, I feel better equipped to handle whatever life will throw at me!  Thereâ\u0080\u0099s nothing worse than feeling â\u0080\u0098hangryâ\u0080\u0099 because itâ\u0080\u0099s taking longer than you want to get a meal. With our Breakfast Guide and Meal System Bundle is an information sheet and video showing you how to quickly make your next meal on short notice.   Our students who adopted a plantify lifestyle share their recipes, ideas, and tricks so you can shorten your learning curve and gain support and encouragement when you need it. You donâ\u0080\u0099t have to walk this path alone - sustain your plantified life well into the future with a community of people just like you.  Love junk food? No Problem! Love pizza? No problem! Love chocolate? Oo-la-la, not a problem, bring on the chocolate! What if you could eat more and weigh less without giving up your favorite foods, like chips, cheese, chocolate, pasta, popcorn, fries, pizza and burgers? Wish granted -- and we can show you how! Almost every family has a picky eater (some families have more than one), and usually those are the kids. Sometimes it could even be your partner. Learn ways to make food your entire family will enjoy without sacrificing your plant-based plan. â\u0080\u009cI tried every diet as well, nothing worked until The Gift of Health, which is the best. Thanks to our good Drs. Rayapudis for their love and support.â\u0080\u009d // Shirley Murley // We get it - it can be scary, even intimidating to change your way of eating. Thatâ\u0080\u0099s where we want to make this a so-amazing-itâ\u0080\u0099s-crazy-if-you-say-no opportunity. Weâ\u0080\u0099re offering you to get started at $197. Take your first step with The Gift of Health. Sign up right now. plus additional 5 installments of $197 (OR 1 payment of $997) Dadâ\u0080\u0099s diagnosis stopped me in my tracks -- and I couldnâ\u0080\u0099t stop thinking about how YOU have the chance to change your health destiny. Whatever you do, please donâ\u0080\u0099t wait until you receive a terrifying diagnosis. Please donâ\u0080\u0099t wait until youâ\u0080\u0099re just another statistic. Please donâ\u0080\u0099t let this opportunity pass you by to take charge of your health right now! You can live life on your own terms. We have the insight and foundation to help you live better with your diet and lifestyle. The choice is yours. All the information is available for you right now to make the best possible choice. We canâ\u0080\u0099t make this choice for you -- we can only show you what weâ\u0080\u0099ve learned, what the science tells us, and what thousands of other people just like you have shared about their experience with our work. â\u0080\u009cI am sleeping better, I lost weight, 20 lbs lighter in two months, my mood is much happier, I am more optimistic, overall I just wanted to say thank you. I was starting to feel like there was not any hope and you gave me that hope. What you do matters and itâ\u0080\u0099s making a huge difference in my life. I really appreciate you and thank you.â\u0080\u009d  â\u0080\u009cYes, I am off both cholesterol and blood pressure meds.and I have lost 40 lbs., I know I have a way to go with my weight but slowly but surely I will get there. Thanks, Gift of Health.â\u0080\u009d â\u0080\u009cI went to the doctor today and he reduced my blood pressure medication to half of what it was. Awesome! This is one of the outcomes I really wanted. Better health and less to no meds. On my way. Thanks to Drs. Arjun and Shobha who put me on the right pathâ\u0080\u009d  For a while, I had trouble with my knees and swelling in my feet. I had a lot of difficulties getting in out of the car because of pain in my joints. I saw on Facebook about the Gift of Health program and decided to give it a try. Within a few weeks, I have been able to walk, jog and even do squats. I was on 4 different medications for high blood pressure and medication for high cholesterol. I don't need them anymore. I tried so many fad diets before. I would lose a few pounds and gain them back. Since joining the gift of health program, I have lost 40 pounds without feeling deprived. I had acid reflux, and I don't have it anymore.  You can continue suffering with your health conditions, dreading what the future may holdâ\u0080¦ â\u0080¦ or, based on our history of creating incredible life-changing results for hundreds of people --  you can trust us to help you restore your health, regain your energy and vitality, and have the impact you want, spend as much time with your friends, family, grandchildren as youâ\u0080\u0099d like, and ultimately fulfill your destiny. And all because you made the decision to change your diet and lifestyle. Itâ\u0080\u0099s really hard to do that from a sick bed.  Itâ\u0080\u0099s really hard to do that from a limited capacity.  Please make the choice today and invest in yourself and your future! Because only you have that power. plus additional 5 installments of $197 (OR 1 payment of $997) Gift of Health is an organization dedicated to empowering people through lifestyle medicine by addressing the root cause of the disease. © 2020 Gift of Health. All rights reserved. \n\t\t\t\tHome | Contactâ\u0080\u008b."
  },
  {
    "url": "https://giftofhealth.org/blog",
    "content": "October 20, 2025   Post by giftofhealth Learn the shocking truth about sugar’s impact on your liver, brain, and energy — and discover how to enjoy desserts that heal instead of harm. Imagine this: You start your day with “healthy” cereal and almond milk. Lunch is a protein bar and a flavoured yogurt. Dinner? A “low-fat” frozen meal. You didn’t touch dessert […]    READ MORE   June 10, 2025   Post by giftofhealth Most doctors long to heal, yet feel limited by the system. What if there’s more? A stirring call to rethink medicine—for those who care and those who suffer.    READ MORE   June 9, 2025   Post by giftofhealth Your grocery cart may predict your future health. Discover one powerful shift to reclaim vitality, from a surgeon’s lens on food and disease.    READ MORE   February 1, 2024   Post by giftofhealth Unravelling the Mystery of Cholesterol: A Conversation with Dr. Shobha Rayapudi Q: I’m doing everything right, but my cholesterol won’t come down. I don’t eat meat but eat chicken or fish occasionally. I eat healthy, I walk every day. I meditate every day. I’m not overweight yet my cholesterol continues to go up. I thought […]    READ MORE   October 16, 2021   Post by giftofhealth Can we lead a disease free life?  And by that, I mean a life without High CHOLESTEROL,  HYPERTENSION,  DIABETES,  HEART DISEASE,  DEMENTIA,  or other chronic conditions that we face such as RHEUMATOID ARTHRITIS,  CHRONIC INFLAMMATORY BOWEL CONDITIONS,  BREAST CANCER, PROSTATE CANCER COLON CANCER, and  DEPRESSION (just to name a few).  What if you already have […]    READ MORE   October 12, 2021   Post by giftofhealth I have worked in health care my entire working life.  I have seen the effects of chronic diseases such as type 2 diabetes and high blood pressure. I wasn’t just seeing it in my job, I was living that life.  I was overweight for many years and on a weight-loss roller coaster.  I would lose […]    READ MORE   October 8, 2021   Post by giftofhealth Wondering what to make for Thanksgiving! Is this your first big family gathering since changing to a plant-based way of eating? Don’t worry, we are here to help you! How to Plantify Thanksgiving! Thanksgiving is about spending time with family and friends and being thankful for all the great things in your life. And what […]    READ MORE   September 13, 2021   Post by giftofhealth “When I first heard about Gift of Health’s Food as Medicine Program, I thought it was just what the Doctor ordered.. Learning a whole new lifestyle? I didn’t think it was possible, could I do it? “I wanted to try Gift of Health’s Food as Medicine Program because as my cholesterol and blood sugar numbers […]    READ MORE   February 26, 2021   Post by giftofhealth We are smiling ear to ear, seeing these pics and messages from Valerie. If you meet her today you would never know how much she has gone through. In fact, she looks like a different person. Last year, around this time, Valerie was struggling with High Blood Pressure, High cholesterol, Type 2 Diabetes, Arthritis, Stomach and […]    READ MORE   July 5, 2020   Post by giftofhealth “We weren’t feeling the best in November 2018. Our cholesterol numbers and blood pressure were creeping up. So we started our search to find how we could take control of our health. It was then we saw the Gift of Health website. We decided to give the recipes a try and cut back on our […]    READ MORE   2017 Gift of Health, all rights reserved."
  },
  {
    "url": "https://giftofhealth.org/contact-us",
    "content": "Please fill out our form below and we'll contact you as soon as possible.                  2017 Gift of Health, all rights reserved."
  },
  {
    "url": "https://giftofhealth.org/appointment-page",
    "content": "BOOK A 1-ON-1 CONSULTATION WITH DR. ARJUN RAYAPUDI Meet with Dr. Arjun Rayapudi for 30 minutes to review your health issues, your current diet and lifestyle, and create an action plan to help you recover from chronic disease.You can meet over zoom meeting or phone.Please specify your preference before your appointment BOOK A 1-ON-1 CONSULTATION WITH DR. SHOBHA RAYAPUDI Meet with Dr. Shobha Rayapudi for 30 minutes to review your health issues, your current diet and lifestyle, and create an action plan to help you recover from chronic disease.You can meet over zoom meeting or phone.Please specify your preference before your appointment 30 min Consultation With Dr. Arjun Rayapudi Over Phone/Zoom:$297 30 min Consultation With Dr. Shobha Rayapudi Over Phone/Zoom:$297 BOOK A 1-ON-1 FOLLOW UP APPOINTMENT WITH DR. ARJUN RAYAPUDI BOOK A 1-ON-1 FOLLOW UP APPOINTMENT WITH DR. SHOBHA RAYAPUDI 30 min follow up session with Dr. Arjun Rayapudi Over Phone/Zoom:$150 30 min follow up session with Dr. Shobha Rayapudi Over Phone/Zoom:$150 BOOK YOUR CONSULTATION WITH BOTH DR. ARJUN RAYAPUDI AND DR. SHOBHA RAYAPUDI 30 min Consultation Over Phone/Zoom:$397CAD 2017 Gift of Health, all rights reserved."
  },
  {
    "url": "https://giftofhealth.org/f-a-qs",
    "content": "These are some of the common questions and concerns raised by people who embark on plant based journey. The protein requirements for healthy adult male are 50-55 grams per day and adult female are 45-50 grams per day.  You can easily meet the protein needs of your body by eating Whole Foods Plant based diet. Almost all whole plant foods contain protein in them. The protein in plant foods is bundled up with fiber and many nutrients like antioxidants, vitamins, minerals and phytochemicals that boost our immune system. When you eat a variety of plant-based foods like oats, brown rice, vegetables, corn, potatoes, beans, and lentils your body will get all the protein it needs for optimal health.  Have you seen anyone low in protein? Protein deficiency is extremely rare in the Western world. Instead, the problem that is widely prevalent is consuming too much protein (2-3 times more than what is required), especially too much animal protein consumption. Intake of animal protein has been associated with various health problems like obesity, high cholesterol, heart disease, breast cancer, colon cancer, prostate cancer, autoimmune diseases, gout, kidney stones.  The fastest period of growth in humans is the first year of life. An infant usually double weight within first 3-5 months. The best for food babies during the rapid period of their growth is mother's breast milk. The percentage of calories that come from protein in mother's milk are 5-6%. Consider the following examples (put a visual guide) (source USDA nutrient database):  Potato (1 medium size) - 4.3 gms of protein - 10% of calories from protein Brown rice (1 cup cooked) - 5 gms- 10% of calories from protein Oats (1 cup cooked)- 6 gms - 16% of calories from protein Black Beans (1cup, cooked)- 15 gms - 26% of calories come from protein Broccoli (1 stalk - 8gms of protein)- 45% protein calories come from protein Spinach - 49% protein (6 gms/per cup cooked) Almonds (1 ounce - 28ms) - 6 gms (16% of calories from protein) Banana (1) - 1.5 gm (1.5% of calories from protein) If you are not convinced, just think of the biggest land animals (elephants, giraffes, horses - where do they get their protein from .. just from eating plants. You do not need to consume any muscle from animals (chicken, fish, turkey, pork, moose, etc.) or dairy products to get your protein. Just eat the Whole plant foods and let the body take care of itself. The purpose of cow's milk is to promote the growth of baby calves. The baby cow grows from 40-50 lbs at birth to 800 to 1000 lbs in one year by drinking cow's milk. Cow's milk is baby calf's growth liquid. Cow's milk has high levels of saturated fat, cholesterol, hormones, antibiotics and environmental toxins like pesticides that we do not need. Intake of dairy products has been linked to higher risk of developing her heart disease, prostate cancer, ovarian cancer and early death. Milk products are also the commonest cause of allergies. The best sources of calcium are whole plant foods like green leafy vegetables, beans, and grains. Vegetables like Broccoli, Kale, Brussels sprouts are very rich in calcium. Other added benefit from these vegetables is that they are also in vitamin K, a nutrient that is essential for healthy bones. Beans and lentils are also an excellent source of calcium. They are also rich in phytates that many improve mineral absorption. Plant based milks like soy milk, almond milk, oat milk are fortified with calcium. There is absolutely no need to eat or drink dairy products to meet your calcium requirements. When you eat a variety of whole plant foods you body will get all the calcium you need.   Complex carbohydrates don't make you fat, and you don't need to avoid them. On the other hand, simple carbs intake should be limited. See the picture below to learn about the differences between simple carbs and complex carbs.    Oils are highly processed foods that are stripped of almost all the nutrients. They are concentrated sources of calories. Oils are devoid of fiber and many of the essential nutrients.  Almost all oils damage endothelium, the inner lining of blood vessels. Also, oils promote inflammation. The health benefits of Mediterranean-style diet is mostly due to whole grains, fruits, vegetables, legumes, walnuts and decreased consumption of meats. It is not just from olive oil.  Watch these short videos from Dr. Esselstyn and Dr. Klaper to learn more about the health concerns associated with consumption of oils   You don't have to break your wallet in the process of leading healthy plant-based lifestyle. 1.) The primary source of energy on plant-based lifestyle will be from grains and beans that don't cost much when you buy them in bulk amounts in the dry state. We stock up on staples like brown rice, oats, dry pasta, beans, lentils and chickpeas in our pantry. 2.) When someone have budget considerations, they can choose to buy half of fruits and vegetables in the frozen state and another half in the fresh state. Frozen vegetables have similar nutritive value when compared to fresh vegetables. 3.) You also save good amount of money as you buy less of animal products (meat, dairy and eggs) and processed foods (oils and other package products) 4.) Preparing your food/Cooking is a great way to reduce the food cost. Here are some of the websites that I recommend for more guidance and ideas FORKS OVER KNIVES ONE GREEN PLANET PLANT BASED ON A BUDGET (choose oil-free recipes)  When these foods are heated, they release cancer-causing causing compounds called heterocyclic amines(HCA) which have been associated with risk of developing cancer. Chicken, turkey, fish, and eggs are significant sources of cholesterol and saturated fat similar to beef and pork. Saturated fat intake and cholesterol intake has been associated with increased risk of developing heart disease. Chicken and turkey contain antibiotics and pesticides. Most of the store bought chicken is contaminated with fecal material have been linked with the development of salmonella, staph, and other infectious diseases. Consumption of Chicken, fish, and egg have also been associated with an increased risk of developing diabetes. Most of the fish contain mercury, which can cause neurologic problems. A study published recently showed that eggs cause intestinal bacteria to make a substance called TMAO, which can increase the risk of heart attacks. For anyone who is following Whole Food Plant Based Lifestyle, it is recommended to take vitamin B12 supplement, at least five micrograms per day.To learn more about Vitamin B12 - check out this article by Dr. McDougall 2017 Gift of Health, all rights reserved."
  },
  {
    "url": "https://giftofhealth.org/nutrition-labels",
    "content": "University of California at Davis Integrative Medicine Program (www.ucdim.com) created an excellent downloadable infographic, \" How to Read a Food Label\".  1. Never believe the claims on the front of the box. What many think are health claims are actually just marketing pitches and advertisements. And government approved claims, like “low-fat” and “light,” often don’t tell you the whole story. These products may be high in fat as well as sugar, salt, and/or calories.  “Light” ice cream, for example, may still pack in 4 to 5 grams of fat per serving. And “light” and “regular” varieties of ice cream may not differ much calorically. Never evaluate a product based on one item, such as its fat, cholesterol, sugar, carbohydrate, or salt content. Attempting to cash in on the latest diet or nutrition craze, many companies promote their products based on a single item despite other unhealthy aspects. (Remember “fat-free” foods that were full of sugar and calories?) To be truly healthy, a product must pass several criteria. 2. Always read the Nutrition Facts label and the ingredient list. They contain information that can really help you determine how healthy a food is. Crackers, for example, may advertise on the front of the box that they’re “trans fat free,” but in the ingredient list you may find fats, like palm oil and coconut oil, that are just as artery-clogging as the trans fats they replaced.  (Tips 3 through 7 show you how to read the Nutrition Facts label.) 3. Check the serving size. Though the government standardized most serving sizes years ago, many products still post unrealistically small sizes. A serving of oil spray, for instance, is .25 grams. That’s about 120th of an ounce — far less than most people could, or would, spray on a pan with even just one squirt. 4. Check the amount of servings per package. Decades ago, many products were in fact single servings. A bottle of cola was one serving. One small candy bar was one serving. Today, many products are “super sized” and contain multiple servings. A 20-ounce bottle of soda contains 2.5 servings, at 110 calories each. Now, in the real world, who’s going to drink just one serving of that bottle? Is it any surprise that many of us are super sized ourselves? 5. Check the calories per serving. All too many people think the “110 calories” posted on that 20-ounce bottle of cola means they’re drinking 110 calories. Hardly. You’ve got to multiply the 110 calories by the total number of servings, 2.5, to realize that you’re actually downing a whopping 275 calories. Don’t get too comfortable with “0s” either. Because some manufacturers use ridiculously small serving sizes (remember that 120th of an ounce of cooking spray?) and because the FDA states that manufacturers can “round down” to zero, some products advertised as calorie-free or fat-free are not. If you eat multiple servings — if, say, you coat an entire skillet with oil spray — you may be tallying up quite a few calories. 6. Check the calories from fat. It’s on the Nutrition Facts label. Unfortunately, it doesn’t tell you “percent of calories from fat,” which is how all health guidelines direct us to limit fat. You’ve got to do a little math. Divide the number of calories from fat by the total calories. (If the serving’s 150 calories, 50 of which are fat, your product is 33 percent calories from fat.). If division trips you up, go by grams. Use this easy rule. If a product has 2 grams of fat or less per 100 calories, its fat content is within these guidelines for processed foods: the fat, per serving, is 20 percent or less of total calories. You don’t have to be a mathematician to realize that 4 grams of fat per 100 calories is double the fat I recommend. Don’t be fooled by claims like “99 percent fat-free” soup or “2 percent fat” milk. They’re based on percent of weight, not percent of calories. So that can of 99 percent fat-free soup may actually have 77 percent of its calories from fat, or more. And 2 percent fat milk actually has about 34 percent of total calories from fat; 1 percent milk has about 23 percent calories from fat. If you live in Canada, their food label does not list calories from fat.  However, the do list grams of fat.  So, to get to calories from fat, just multiply grams of fat by 9 and you have calories from fat.   And, if you do not like math, just multiply by 10 and it will be close enough as they already round numbers off. 7. Check the sodium. Don’t bother with the percentage of Daily Value (DV) of sodium. Don’t bother with Daily Value percentages, period. They’re based on government standards, which are generally not the healthiest guidelines to strive for. Instead, look at the number of milligrams of sodium the serving contains. A great rule of thumb: Limit the sodium in milligrams to no more than the number of calories in each serving. Your daily goal: less than 1,500mg of sodium.  (Tips 8, 9, and 10 show you how to read the ingredient list.) 8. Check the types of fat. Make sure there are no saturated fats, hydrogenated fats, or tropical oils in the ingredient list, including lard, butter, coconut, cocoa butter, palm oils, shortening, margarine, chocolate, and whole and part-skim dairy products. Polyunsaturated fats (like safflower, soybean, corn, and sesame) and monounsaturated fats (such as olive and canola) are less harmful and would be acceptable, but make sure the percentage of calories from fat are still in line — 20 percent calories from fat or less — or your waistline may start getting out of line. All oils, even “good” oils, are dense with calories. 9. Check the sugar. Limit caloric sweeteners. Watch out for sugars and other caloric sweeteners that don’t say “sugar” but in fact are, such as corn syrup, rice and maple syrup, molasses, honey, malted barley, barley malt, or any term that ends in “ol,” such as sorbitol or maltitol, or “ose,” such as dextrose or fructose. Try to limit all these added, refined, concentrated sugars to no more than 5 percent of total calories (essentially, no more than 2 tablespoons daily for most folks). Don’t be concerned about naturally occurring sugars in fruit and some nonfat dairy products. However, on the Nutrition Facts label, added sugars and naturally occurring sugars are all lumped together as “sugar.” Your best bet: Look at the ingredient list. Try to avoid foods with added, refined caloric sweeteners in the first three to five ingredients. Because ingredients are listed in descending order of weight, the lower down the label you find added sugars, the better. 10. Make sure that any grain is WHOLE grain. Many bread and pasta products claim to be whole wheat, but the first ingredient in the ingredient list is often wheat flour, which sounds healthy, but it’s really refined flour. Further down the list will be whole-wheat flour or bran. Scout out products that contain only whole grains. Also look for at least 3 grams of fiber per serving, which often ensures the product is mostly, if not all, whole grain. If the product sounds too good to be true, it may be. Thousands of new products come out every year, many trying to cash in on the latest diet craze. As we’ve seen with the low-carb craze, many may not be carefully regulated (if at all). In 2001 the Florida FDA evaluated 67 diet products and found all 67 were inaccurately labeled; they contained more sugar and carbs than their labels stated. And recently, consumer laboratories evaluated 30 low-carb nutrition bars and found that 60 percent were inaccurately labeled. Most had more carbs, sugars, and salt than their labels claimed. During your first few trips to the market, give yourself extra time to evaluate products. You’ll soon speed up! Once you’ve found products that you enjoy and that meet these healthy guidelines, shopping becomes quick and easy. Your health is worth it! Remember, WHOLE, natural, unadulterated foods, not packaged and manufactured foods, are those foods that pack the nutrient punch. Even when you pick from the “acceptable” processed foods, it should be only a minor part of your diet. In Health,\nJeff 2017 Gift of Health, all rights reserved."
  },
  {
    "url": "https://giftofhealth.org/recipes",
    "content": ""
  },
  {
    "url": "https://giftofhealth.org/eat-to-lower-cholesterol",
    "content": ""
  },
  {
    "url": "https://giftofhealth.org/who-we-are",
    "content": ""
  },
  {
    "url": "https://giftofhealth.org/our-mission",
    "content": "2017 Gift of Health, all rights reserved."
  },
  {
    "url": "https://giftofhealth.org/success-stories",
    "content": "Sorry, but the page you are looking for does not exists. 2017 Gift of Health, all rights reserved."
  },
  {
    "url": "https://giftofhealth.org/givegiftofhealth",
    "content": "- Hippocrates (Father of Modern Medicine) Hi; I am Dr. Arjun Rayapudi, a general surgeon and a plant-based community nutritionist. My wife, Dr. Shobha Rayapudi, is a physician, researcher and clinical trialist. (Click here to learn more about us.) We welcome you to Giftofhealth.org We created this website to help you reach your highest health and decrease unnecessary suffering on our planet. Through this site, we hope to raise awareness about the connection between food/lifestyle choices and health. During our training, clinical practice, and research work, we discovered, that most of the diseases that many patients suffer are due to their diet and lifestyle choices. In our medical school education and residency training, there was an enormous emphasis on taking care of sick patients with pills and procedures. We observed that there was greater emphasis on managing the symptoms rather than focusing on the cause of the problem. Medications and surgeries work well for most of the acute diseases and some chronic diseases. However, they are not the best options for managements of several chronic medical problems when compared to the power of food and lifestyle choices. There is evidence in the medical literature that almost 80% of chronic diseases are potentially avoidable if one follows optimal nutrition, stays active, manages stress healthfully and doesn’t smoke. I would like to share my dad's health story to put things in perspective. His story is a testament to the healing power of the human body.  My Dad is 67, he was a diabetic for about twenty-six years. He was also on medications for high blood pressure for over two decades. He was diagnosed with Heart disease (coronary artery disease) in March of 2015. He had symptoms of shortness of breath with mild strenuous activities. His angiogram (dye test/ special X-Ray test to check blood flow in heart vessels) showed greater than 90% blockages in two of the three main blood vessels that supply the heart. One cardiologist recommended to have stents, and another cardiologist recommended considering bypass surgery. Our education in plant-based nutrition and awareness regarding work of Dr. Esselstyn helped us to guide my dad making the right choice. Dr. Caldwell Esselstyn and Dr. Dean Ornish have shown that stable heart disease can be reversed/arrested with whole foods plant based diet. I consulted Dr. Esselstyn and my friend Dr. Shane Williams (www.williamscardiology.com). Both of them said that if my dad wants to live longer, healthier and happier opt for plant-based diet (oil free), and there is no need for stents and bypass. My father embraced Whole food plant based lifestyle in March of 2015 as the per their advice. My Mom and our family agreed to create a healthy environment around him to help with the transition. My Mom created tasty plant-based recipes as per Dr. Esselstyn's guidelines. In the beginning, my dad was skeptical about the power of nutrition and the fact that he was doing something against the recommendation of his cardiologist, but he soon noticed having more energy and better mental clarity with the new way of eating. Within 15 days of starting plant-based journey, his diabetic medications dose was reduced by half. He was overjoyed with the reduction of medications which motivated him to learn more about plant-based eating. He read Dr. Neal Barnard's Program for Reversing Diabetes and Dr. Esselstyn's Prevent and Reverse Heart Disease and used the material in those books in his daily life. I am jubilant to let you know that, in the last four and half months he has not had any shortness of breath or chest pain, and he lost 12 kilograms (twenty-five pounds). He is quite happy to be off his diabetic medications and blood pressure drugs that he took for 26 years. He was on two medications for diabetes and two medications for high blood pressure before he started plant-based diet and within three months of new lifestyle he is off of them. His cholesterol level also became normal, dropped from 165 to 110. Our family is very excited about our dad's health journey. Thanks to healing plant-based foods and works of Dr. Caldwell Esselstyn Jr., Dr. Dean Ornish, Dr. Colin Campbell, Dr. John McDougall, Dr. Michael Greger and Dr. Neal Barnard. The evidence for whole food-plant based lifestyle is so overwhelming. Visit www.nutritionfacts.org, www.heartattackproof.com,  www.nutritionstudies.org,  www.drmcdougall.com,   or other websites listed in the resources section for research/evidence favoring plant-based nutrition. Plant-based lifestyle also helped me to take back my health. I lost close to 50 pounds; reached healthier weight seven years ago and sustained it. No calorie counting. No portion control. Lifestyle centered on eating plenty of the fiber rich, nutrient rich and delicious whole/minimally processed plant-based foods.  For summary of benefits of Whole Food Plant Based Lifestyle see the following infographic.  2017 Gift of Health, all rights reserved."
  },
  {
    "url": "https://giftofhealth.org/eventlist",
    "content": "Upcoming Events 26sep(sep 26)3:00 pm06nov(nov 6)5:00 pmFeatured6weeks Online GOH Food as Medicine ProgramOnline Course(september 26) 3:00 pm - (november 6) 5:00 pm NT Event Type :Online Course Click here for more DetailsStart Date:  26th Sep 2025\nEnd Date:  6th Nov 2025 \nRegister Here:   September 26 (Friday) 3:00 pm - November 6 (Thursday) 5:00 pm   LINKhttps://giftofhealth.org/6wks_online_course/course-detail.html   Gift of Health giftofhealth1@gmail.com CalendarGoogleCal Past Workshops 24janallday06maralldayFeatured6weeks Online GOH Food as Medicine ProgramOnline Course(All Day) NT Event Type :Online Course Click here for more Details6 Weeks Food as Medicine course\nStarting From Jan 24th 2024 January 24 (Friday) - March 6 (Thursday)   LINKhttps://giftofhealth.org/6wks_online_course/course-detail.html   Gift of Health giftofhealth1@gmail.com CalendarGoogleCal 24novallday27alldayOil-Free Indian Cooking CourseOnline Program(All Day) NT ONLINE Burin, Newfoundland and Labrador, A0E 1E0Event Type :Online Course Click here for more DetailsDate:  24th Nov 2023Register Here: november 24 (Friday) - 27 (Monday) NT ONLINE Burin, Newfoundland and Labrador, A0E 1E0  CalendarGoogleCal 24novallday27alldayWhole Food Plant-Based Cooking CourseOnline Program(All Day) NT ONLINE Burin, Newfoundland and Labrador, A0E 1E0Event Type :Online Course Click here for more DetailsDate:  24th Nov 2023Register Here: november 24 (Friday) - 27 (Monday) NT ONLINE Burin, Newfoundland and Labrador, A0E 1E0  CalendarGoogleCal 05may(may 5)6:30 pm07(may 7)4:00 pmOnline SKY Breath MeditationOnline Program6:30 pm - 4:00 pm (7) NT ONLINE Burin, Newfoundland and Labrador, A0E 1E0Event Type :Online Course Click here for more DetailsDate:  5th-7th May 2023\nTimes: FRI: 6:30pm - 9:30pm NT (5:00 PM - 8:00 PM EST)\nSAT,   5 (Friday) 6:30 pm - 7 (Sunday) 4:00 pm NT ONLINE Burin, Newfoundland and Labrador, A0E 1E0  CalendarGoogleCal 25aprallday12maralldayFeatured1 Yr Mentorship CourseOnline Course(All Day) NT Event Type :Online Course 1 Yr Mentorship Course\nStarting From April 25th, 2023\n \nClick here for more Details\n      April 25 (Tuesday) - March 12 (Tuesday)   LINKhttps://giftofhealth.org/6wks_online_course/course-detail.html   Gift of Health giftofhealth1@gmail.com CalendarGoogleCal 05decallday09alldayFeatured5 Days Breakfast ChallengeOnline Course(All Day) NT Event Type :Online Course Black Friday Sale\n5 Day Breakfast Challenge\nStarting From Dec 5th 2022 to Dec 9th 2022\n    december 5 (Monday) - 9 (Friday)   Gift of Health giftofhealth1@gmail.com CalendarGoogleCal 2017 Gift of Health, all rights reserved."
  },
  {
    "url": "https://giftofhealth.org/cucumber-chickpea-salad",
    "content": "Post by giftofhealth BOOKMARK PRINT SHARE Rosa Moulton introduced us to this simple yet delicious salad. It goes well with any side dish. You can adjust the quantity of vinegar and sweetener to your liking. Method: Combine all the ingredients and you have a wonderful salad in a jiffy, plus an instant crowd pleaser!  Appetizers, Holiday Specials, New, Snacks Posted On October 7, 2025  Holiday Specials, Lunches/Dinners, New Posted On July 22, 2025 Your email address will not be published.  Save my name, email, and website in this browser for the next time I comment. Comment *    2017 Gift of Health, all rights reserved."
  }
]